[
    {
        "title": "Tec Reserves",
        "shortDescription": "iOS app and website for the Cybersecurity Hub of Tecnológico de Monterrey, enabling resource reservations and management.",
        "fullDescription": "Led the development of an iOS mobile app and a complementary website for the Cybersecurity Hub of Tecnológico de Monterrey.\n The app and website allow users to easily reserve resources such as meeting rooms and equipment at the Hub, while also providing tools for efficient resource management.\n I was participated in the entire project lifecycle, from user requirements collection and system design to interface creation and app development. The mobile app was built using Swift in Xcode, focusing on an intuitive user experience, and the website was developed using Svelte, HTML, and CSS, ensuring a cohesive experience across platforms.\n The project showcased my skills in project management, user interface design, and software development, and was developed using Scrum and Kanban methodologies.",
        "bannerImage": "tec1.png",
        "image2": "tec2.png",
        "tags": ["iOS Development", "Web Development", "Cybersecurity", "Project Management"],
        "technologies": ["Swift", "Xcode", "Svelte", "HTML", "CSS", "JavaScript", "Lucidchart", "Marvelapp", "PostgreSQL", "DigitalOcean"],
        "methodologies": ["Scrum", "Kanban"],
        "user": "Cybersecurity Hub, Tecnológico de Monterrey",
        "url": "/projects/tec-reserves",
        "github": "https://github.com/AugustoAleman"
    },
    {
        "title": "Drive AI",
        "shortDescription": "Dynamic car sales website designed for NDS Cognitive Labs, connecting dealerships with buyers across Mexico.",
        "fullDescription": "Designed and developed a dynamic website for NDS Cognitive Labs, adhering to ISO/IEC/IEEE 29148 standards. The project involved business model creation, monetization, and value proposition design. I led the user-centric design using Figma, developed the front-end with React and Styled Components, and built the back-end infrastructure with Java SpringBoot and Docker. CI/CD pipelines were integrated for continuous deployment on Vercel and AWS S3, ensuring scalability and reliability.\n The project was managed using Agile methodologies, with progress tracked through Azure DevOps. My contributions focused on user flow design, interface development, and implementing CRUD operations for documents.",
        "bannerImage": "drive-ai.png",
        "image2": "drive-ai1.png",
        "tags": ["Web Development", "Front-End", "Back-End", "Databases", "Project Management"],
        "technologies": ["React", "Java SpringBoot", "Docker", "MySQL", "AWS S3", "Vercel", "Figma", "Visual Paradigm"],
        "methodologies": ["Agile", "ISO/IEC/IEEE 29148"],
        "user": "NDS Cognitive Labs",
        "url": "/projects/drive-ai",
        "github": "https://github.com/AugustoAleman/DriveAI"
    },
    {
        "title": "Liverpool Insights Hub",
        "shortDescription": "Interactive Analytics Dashboard to reduce employee turnover for El Puerto de Liverpool.",
        "fullDescription": "Led the development of an Interactive Analytics Dashboard for El Puerto de Liverpool, aimed at reducing employee turnover through data-driven insights.\n The dashboard featured real-time KPIs and predictive analytics, including a classification model to identify potential resignations and a regression model to forecast employee tenure, thereby enhancing HR strategic planning.\n The project involved end-to-end management, from user flow design and UI mockups in Figma to data integration, preprocessing, and machine learning model development using Python, Pandas, NumPy, Dash, and Scikit-Learn. The intuitive dashboard significantly improved decision-making processes.",
        "bannerImage": "liverpool2.png",
        "image2": "liverpool1.png",
        "tags": ["AI", "Machine Learning", "Data Science", "Web Development", "Predictive Analytics"],
        "technologies": ["Python", "Pandas", "NumPy", "Dash", "Scikit-Learn", "Matplotlib", "Plotly", "SQL", "Figma"],
        "methodologies": ["Kanban", "Agile"],
        "user": "El Puerto de Liverpool",
        "url": "/projects/liverpool-insights-hub",
        "github": "https://github.com/AugustoAleman/LiverpoolDataAnalytics"
    },
    {
        "title": "Sentinel AI",
        "shortDescription": "Ensemble method using Machine Learning and Deep Learning models to prevent phishing for Beiersdorf.",
        "fullDescription": "Developed and deployed an ensemble of Machine Learning and Deep Learning models to classify SPAM emails for Beiersdorf, achieving a 94% accuracy, significantly surpassing the company's minimum requirement. \n Leveraged Python, Scikit-Learn, PyTorch, and Transformers for data preprocessing and model training. Utilized FastAPI for deploying the solution on Azure's cloud infrastructure, ensuring scalability and reliability.\n The project involved a full pipeline implementation, from data collection and preprocessing to model deployment. Despite the small dataset, the ensemble approach provided robust initial results, with plans for further enhancement as more data is collected.",
        "bannerImage": "sentinel_ai1.png",
        "image2": "sentinel_ai2.png",
        "tags": ["AI", "Machine Learning", "Deep Learning", "Data Science", "Web Development"],
        "technologies": ["Python", "Scikit-Learn", "PyTorch", "Transformers", "FastAPI", "Azure"],
        "methodologies": ["Kanban"],
        "user": "Beiersdorf",
        "url": "/projects/sentinel-ai",
        "github": "https://github.com/AugustoAleman"
    }
    
]
